In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

'tr' denotes train dataset | 
'te' denotes test dataset

In [2]:
tr = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
te = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.test',skiprows=[0])

In [3]:
col_labels = ['age', 'workclass', 'FinalWeight', 'education', 'education_num', 'marital_status',
'occupation','relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week',
'native_country', 'wage_class']
tr.columns=col_labels
te.columns=col_labels

In [4]:
tr

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [5]:
te

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
1,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
2,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
3,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.
4,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16275,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States,<=50K.
16276,64,?,321403,HS-grad,9,Widowed,?,Other-relative,Black,Male,0,0,40,United-States,<=50K.
16277,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K.
16278,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States,<=50K.
16279,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,>50K.

TRAIN SET DATA CLEANING

Removing QuestionMark(?)

In [6]:
tr.isnull().sum()

age               0
workclass         0
FinalWeight       0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
wage_class        0
dtype: int64

In [7]:
print(tr['age'].unique())
print(tr['workclass'].unique())
print(tr['FinalWeight'].unique())
print(tr['education'].unique())
print(tr['education_num'].unique())
print(tr['marital_status'].unique())
print(tr['occupation'].unique())
print(tr['relationship'].unique())
print(tr['race'].unique())
print(tr['sex'].unique())
print(tr['capital_gain'].unique())
print(tr['capital_loss'].unique())
print(tr['hours_per_week'].unique())
print(tr['native_country'].unique())
print(tr['wage_class'].unique())

[50 38 53 28 37 49 52 31 42 30 23 32 40 34 25 43 54 35 59 56 19 39 20 45
 22 48 21 24 57 44 41 29 18 47 46 36 79 27 67 33 76 17 55 61 70 64 71 68
 66 51 58 26 60 90 75 65 77 62 63 80 72 74 69 73 81 78 88 82 83 84 85 86
 87]
[' Self-emp-not-inc' ' Private' ' State-gov' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']
[ 83311 215646 234721 ...  34066  84661 257302]
[' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']
[13  9  7 14  5 10 12 11  4 16 15  3  6  2  1  8]
[' Married-civ-spouse' ' Divorced' ' Married-spouse-absent'
 ' Never-married' ' Separated' ' Married-AF-spouse' ' Widowed']
[' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Adm-clerical' ' Sales' ' Craft-repair'
 ' Transport-moving' ' Farming-fishing' ' Machine-op-inspct'
 ' Tech-support' ' ?' ' Protective-serv' ' Armed-Forces'
 ' Priv-house-serv']
[' Husband' ' Not-in-family' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']
[' White' ' Black' ' Asian-Pac-Islander' ' Amer-Indian-Eskimo' ' Other']
[' Male' ' Female']
[    0 14084  5178  5013  2407 14344 15024  7688 34095  4064  4386  7298
  1409  3674  1055  3464  2050  2176  2174   594 20051  6849  4101  1111
  8614  3411  2597 25236  4650  9386  2463  3103 10605  2964  3325  2580
  3471  4865 99999  6514  1471  2329  2105  2885 25124 10520  2202  2961
 27828  6767  2228  1506 13550  2635  5556  4787  3781  3137  3818  3942
   914   401  2829  2977  4934  2062  2354  5455 15020  1424  3273 22040
  4416  3908 10566   991  4931  1086  7430  6497   114  7896  2346  3418
  3432  2907  1151  2414  2290 15831 41310  4508  2538  3456  6418  1848
  3887  5721  9562  1455  2036  1831 11678  2936  2993  7443  6360  1797
  1173  4687  6723  2009  6097  2653  1639 18481  7978  2387  5060]
[   0 2042 1408 1902 1573 1887 1719 1762 1564 2179 1816 1980 1977 1876
 1340 2206 1741 1485 2339 2415 1380 1721 2051 2377 1669 2352 1672  653
 2392 1504 2001 1590 1651 1628 1848 1740 2002 1579 2258 1602  419 2547
 2174 2205 1726 2444 1138 2238  625  213 1539  880 1668 1092 1594 3004
 2231 1844  810 2824 2559 2057 1974  974 2149 1825 1735 1258 2129 2603
 2282  323 4356 2246 1617 1648 2489 3770 1755 3683 2267 2080 2457  155
 3900 2201 1944 2467 2163 2754 2472 1411]
[13 40 16 45 50 80 30 35 60 20 52 44 15 25 38 43 55 48 58 32 70  2 22 56
 41 28 36 24 46 42 12 65  1 10 34 75 98 33 54  8  6 64 19 18 72  5  9 47
 37 21 26 14  4 59  7 99 53 39 62 57 78 90 66 11 49 84  3 17 68 27 85 31
 51 77 63 23 87 88 73 89 97 94 29 96 67 82 86 91 81 76 92 61 74 95]
[' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']
[' <=50K' ' >50K']

In [8]:
tr.isin([' ?']).sum()

age                  0
workclass         1836
FinalWeight          0
education            0
education_num        0
marital_status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital_gain         0
capital_loss         0
hours_per_week       0
native_country     583
wage_class           0
dtype: int64

In [9]:
tr['workclass']=tr['workclass'].replace(' ?',np.NaN)

In [10]:
tr['workclass']=tr['workclass'].replace(' ?',np.NaN)
tr['occupation']=tr['occupation'].replace(' ?',np.NaN)
tr['native_country']=tr['native_country'].replace(' ?',np.NaN)

In [11]:
tr = tr.dropna()

In [12]:
tr

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

LABEL ENCODING TRAIN DATA

In [13]:

from sklearn.preprocessing import LabelEncoder
lr=LabelEncoder()
for i in tr.iloc[:,[1,3,5,6,7,8,9,13]]:
    tr[i]=lr.fit_transform(tr[i])

In [14]:
tr

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,50,4,83311,9,13,2,3,0,4,1,0,0,13,38,<=50K
1,38,2,215646,11,9,0,5,1,4,1,0,0,40,38,<=50K
2,53,2,234721,1,7,2,5,0,2,1,0,0,40,38,<=50K
3,28,2,338409,9,13,2,9,5,2,0,0,0,40,4,<=50K
4,37,2,284582,12,14,2,3,5,4,0,0,0,40,38,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,2,257302,7,12,2,12,5,4,0,0,0,38,38,<=50K
32556,40,2,154374,11,9,2,6,0,4,1,0,0,40,38,>50K
32557,58,2,151910,11,9,6,0,4,4,0,0,0,40,38,<=50K
32558,22,2,201490,11,9,4,0,3,4,1,0,0,20,38,<=50K
32559,52,3,287927,11,9,2,3,5,4,0,15024,0,40,38,>50K

In [15]:
tr.drop(['FinalWeight','education_num'],axis=1,inplace=True)

In [16]:
tr

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,50,4,9,2,3,0,4,1,0,0,13,38,<=50K
1,38,2,11,0,5,1,4,1,0,0,40,38,<=50K
2,53,2,1,2,5,0,2,1,0,0,40,38,<=50K
3,28,2,9,2,9,5,2,0,0,0,40,4,<=50K
4,37,2,12,2,3,5,4,0,0,0,40,38,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,2,7,2,12,5,4,0,0,0,38,38,<=50K
32556,40,2,11,2,6,0,4,1,0,0,40,38,>50K
32557,58,2,11,6,0,4,4,0,0,0,40,38,<=50K
32558,22,2,11,4,0,3,4,1,0,0,20,38,<=50K
32559,52,3,11,2,3,5,4,0,15024,0,40,38,>50K

In [17]:
tr['wage_class'].unique()

array([' <=50K', ' >50K'], dtype=object)

In [18]:
tr['wage_class'] = tr['wage_class'].map({' <=50K':0,' >50K':1})

In [19]:
tr

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,50,4,9,2,3,0,4,1,0,0,13,38,0
1,38,2,11,0,5,1,4,1,0,0,40,38,0
2,53,2,1,2,5,0,2,1,0,0,40,38,0
3,28,2,9,2,9,5,2,0,0,0,40,4,0
4,37,2,12,2,3,5,4,0,0,0,40,38,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,2,7,2,12,5,4,0,0,0,38,38,0
32556,40,2,11,2,6,0,4,1,0,0,40,38,1
32557,58,2,11,6,0,4,4,0,0,0,40,38,0
32558,22,2,11,4,0,3,4,1,0,0,20,38,0
32559,52,3,11,2,3,5,4,0,15024,0,40,38,1

DATA CLEANING TEST DATASET

In [20]:
te.isin([' ?']).sum()

age                 0
workclass         963
FinalWeight         0
education           0
education_num       0
marital_status      0
occupation        966
relationship        0
race                0
sex                 0
capital_gain        0
capital_loss        0
hours_per_week      0
native_country    274
wage_class          0
dtype: int64

In [21]:

te['workclass']=te['workclass'].replace(' ?',np.NaN )
te['occupation']=te['occupation'].replace(' ?',np.NaN )
te['native_country']=te['native_country'].replace(' ?',np.NaN )

In [22]:
te = te.dropna()

In [23]:
te

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
1,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
2,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K.
6,63,Self-emp-not-inc,104626,Prof-school,15,Married-civ-spouse,Prof-specialty,Husband,White,Male,3103,0,32,United-States,>50K.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16274,33,Private,245211,Bachelors,13,Never-married,Prof-specialty,Own-child,White,Male,0,0,40,United-States,<=50K.
16275,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States,<=50K.
16277,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K.
16278,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States,<=50K.
16279,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,>50K.

LabelEncoding TestDataset

In [24]:
from sklearn.preprocessing import LabelEncoder
lr=LabelEncoder()
for i in te.iloc[:,[1,3,5,6,7,8,9,13]]:
    te[i]=lr.fit_transform(te[i])

In [25]:
te

,age,workclass,FinalWeight,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,38,2,89814,11,9,2,4,0,4,1,0,0,50,37,<=50K.
1,28,1,336951,7,12,2,10,0,4,1,0,0,40,37,>50K.
2,44,2,160323,15,10,2,6,0,2,1,7688,0,40,37,>50K.
4,34,2,198693,0,6,4,7,1,4,1,0,0,30,37,<=50K.
6,63,4,104626,14,15,2,9,0,4,1,3103,0,32,37,>50K.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16274,33,2,245211,9,13,4,9,3,4,1,0,0,40,37,<=50K.
16275,39,2,215419,9,13,0,9,1,4,0,0,0,36,37,<=50K.
16277,38,2,374983,9,13,2,9,0,4,1,0,0,50,37,<=50K.
16278,44,2,83891,9,13,0,0,3,1,1,5455,0,40,37,<=50K.
16279,35,3,182148,9,13,2,3,0,4,1,0,0,60,37,>50K.

In [27]:
te.drop(['FinalWeight','education_num'],axis=1,inplace=True)

In [28]:
te

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,38,2,11,2,4,0,4,1,0,0,50,37,<=50K.
1,28,1,7,2,10,0,4,1,0,0,40,37,>50K.
2,44,2,15,2,6,0,2,1,7688,0,40,37,>50K.
4,34,2,0,4,7,1,4,1,0,0,30,37,<=50K.
6,63,4,14,2,9,0,4,1,3103,0,32,37,>50K.
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16274,33,2,9,4,9,3,4,1,0,0,40,37,<=50K.
16275,39,2,9,0,9,1,4,0,0,0,36,37,<=50K.
16277,38,2,9,2,9,0,4,1,0,0,50,37,<=50K.
16278,44,2,9,0,0,3,1,1,5455,0,40,37,<=50K.
16279,35,3,9,2,3,0,4,1,0,0,60,37,>50K.

In [29]:
te.wage_class.unique()

array([' <=50K.', ' >50K.'], dtype=object)

In [30]:
te['wage_class'] = te['wage_class'].map({' <=50K.':0,' >50K.':1})

In [31]:
te

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,38,2,11,2,4,0,4,1,0,0,50,37,0
1,28,1,7,2,10,0,4,1,0,0,40,37,1
2,44,2,15,2,6,0,2,1,7688,0,40,37,1
4,34,2,0,4,7,1,4,1,0,0,30,37,0
6,63,4,14,2,9,0,4,1,3103,0,32,37,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16274,33,2,9,4,9,3,4,1,0,0,40,37,0
16275,39,2,9,0,9,1,4,0,0,0,36,37,0
16277,38,2,9,2,9,0,4,1,0,0,50,37,0
16278,44,2,9,0,0,3,1,1,5455,0,40,37,0
16279,35,3,9,2,3,0,4,1,0,0,60,37,1

#Test Train Split

In [32]:
X_train = tr.iloc[:,:-1]
y_train = tr.iloc[:,-1]
X_test = te.iloc[:,:-1]
y_test = te.iloc[:,-1]

In [33]:
X_train

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,50,4,9,2,3,0,4,1,0,0,13,38
1,38,2,11,0,5,1,4,1,0,0,40,38
2,53,2,1,2,5,0,2,1,0,0,40,38
3,28,2,9,2,9,5,2,0,0,0,40,4
4,37,2,12,2,3,5,4,0,0,0,40,38
...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,2,7,2,12,5,4,0,0,0,38,38
32556,40,2,11,2,6,0,4,1,0,0,40,38
32557,58,2,11,6,0,4,4,0,0,0,40,38
32558,22,2,11,4,0,3,4,1,0,0,20,38
32559,52,3,11,2,3,5,4,0,15024,0,40,38

In [34]:
y_train

0        0
1        0
2        0
3        0
4        0
        ..
32555    0
32556    1
32557    0
32558    0
32559    1
Name: wage_class, Length: 30161, dtype: int64

In [35]:
X_test

,age,workclass,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,38,2,11,2,4,0,4,1,0,0,50,37
1,28,1,7,2,10,0,4,1,0,0,40,37
2,44,2,15,2,6,0,2,1,7688,0,40,37
4,34,2,0,4,7,1,4,1,0,0,30,37
6,63,4,14,2,9,0,4,1,3103,0,32,37
...,...,...,...,...,...,...,...,...,...,...,...,...
16274,33,2,9,4,9,3,4,1,0,0,40,37
16275,39,2,9,0,9,1,4,0,0,0,36,37
16277,38,2,9,2,9,0,4,1,0,0,50,37
16278,44,2,9,0,0,3,1,1,5455,0,40,37
16279,35,3,9,2,3,0,4,1,0,0,60,37

In [36]:
y_test

0        0
1        1
2        1
4        0
6        1
        ..
16274    0
16275    0
16277    0
16278    0
16279    1
Name: wage_class, Length: 15059, dtype: int64

XGBOOST MODELING

In [37]:
from xgboost import XGBClassifier
model = XGBClassifier()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)

In [38]:
model = XGBClassifier()
model.fit(X_train, y_train)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0, gpu_id=-1,
              importance_type='gain', interaction_constraints='',
              learning_rate=0.300000012, max_delta_step=0, max_depth=6,
              min_child_weight=1, missing=nan, monotone_constraints='()',
              n_estimators=100, n_jobs=0, num_parallel_tree=1,
              objective='binary:logistic', random_state=0, reg_alpha=0,
              reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', validate_parameters=1, verbosity=None)

In [39]:
from xgboost import XGBClassifier

In [40]:
y_pred = model.predict(X_test)

In [41]:
y_pred

array([0, 1, 1, ..., 1, 0, 1], dtype=int64)

Accuracy_score | Confusion_matrix

In [42]:
from sklearn.metrics import accuracy_score , confusion_matrix

In [43]:
confusion_matrix(y_test, y_pred)

array([[10793,   566],
       [ 1456,  2244]], dtype=int64)

In [44]:
accuracy_score(y_test, y_pred)

0.8657281359984063

CLASSIFICATION REPORT

In [45]:
from sklearn.metrics import classification_report
classification_report(y_test, y_pred)

'              precision    recall  f1-score   support\n\n           0       0.88      0.95      0.91     11359\n           1       0.80      0.61      0.69      3700\n\n    accuracy                           0.87     15059\n   macro avg       0.84      0.78      0.80     15059\nweighted avg       0.86      0.87      0.86     15059\n'